### Exercise 136: Computing DataFrames within DataFrames

In [3]:
import pandas as pd
# Create dictionary of test scores
test_dict = {'Corey':[63,75,88], 'Kevin':[48,98,92], 'Akshay': [87, 86, 85]}
# Create DataFrame
df = pd.DataFrame(test_dict)

In [7]:
df

   Corey  Kevin  Akshay
0     63     48      87
1     75     98      86
2     88     92      85

In [9]:
# Limit DataFrame to first 2 rows
df[0:2]

   Corey  Kevin  Akshay
0     63     48      87
1     75     98      86

In [11]:
df = df.T
df

         0   1   2
Corey   63  75  88
Kevin   48  98  92
Akshay  87  86  85

In [13]:
# Rename Columns
df.columns = ['Quiz_1', 'Quiz_2', 'Quiz_3']
df

        Quiz_1  Quiz_2  Quiz_3
Corey       63      75      88
Kevin       48      98      92
Akshay      87      86      85

In [15]:
# Defining a new DataFrame from first 2 rows and last 2 columns
rows = ['Corey', 'Kevin']
cols = ['Quiz_2', 'Quiz_3']
df_spring = df.loc[rows, cols]
df_spring

       Quiz_2  Quiz_3
Corey      75      88
Kevin      98      92

In [21]:
df.iloc[[0,1],[1,2]]

       Quiz_2  Quiz_3
Corey      75      88
Kevin      98      92

In [23]:
# Define new column as mean of other columns
df['Quiz_Avg'] = df.mean(axis=1)
df

        Quiz_1  Quiz_2  Quiz_3   Quiz_Avg
Corey       63      75      88  75.333333
Kevin       48      98      92  79.333333
Akshay      87      86      85  86.000000

In [25]:
df['Quiz_4'] = [92, 95, 88]
df

        Quiz_1  Quiz_2  Quiz_3   Quiz_Avg  Quiz_4
Corey       63      75      88  75.333333      92
Kevin       48      98      92  79.333333      95
Akshay      87      86      85  86.000000      88

In [27]:
del df['Quiz_Avg']
df

        Quiz_1  Quiz_2  Quiz_3  Quiz_4
Corey       63      75      88      92
Kevin       48      98      92      95
Akshay      87      86      85      88

In [29]:
df['Quiz_Avg'] = df.mean(axis=1)
df

        Quiz_1  Quiz_2  Quiz_3  Quiz_4  Quiz_Avg
Corey       63      75      88      92     79.50
Kevin       48      98      92      95     83.25
Akshay      87      86      85      88     86.50